# Options
cask_args appdir: '~/Applications'

# Taps
tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'

##################
# Casks
##################

cask 'adobe-creative-cloud'
cask 'basecamp'
cask 'cocoarestclient'
cask 'dash'
cask 'docker'
cask 'google-chrome'
cask 'iterm2'
cask 'keepassx'
cask 'sequel-pro'
cask 'sketch'
cask 'rectangle'
cask 'the-unarchiver'
cask 'toggl'

##################
# Brews
##################

# Shell
    brew 'reattach-to-user-namespace'
    brew 'tmux'
    brew 'trash'
    brew 'tree'
    brew 'watchman'
    brew 'zsh'

# Editor
    brew 'neovim'
    brew 'fzf'

# Git
    brew 'git'
    brew 'hub'

# Ruby
    brew 'chruby'
    brew 'ruby-install'

# JavaScript
    brew 'n'
    brew 'yarn', args: ['without-node']

# PHP
    brew 'php'
    brew 'composer'

# Database
    brew 'mysql'

# General
    # Image manipulation
    brew 'gd'
    brew 'imagemagick'
